domhathair/esp32-c3/lib/Sleep/include/sleep_modes.h
    // Enter sleep
    rtc_sleep_config_t config;
    rtc_sleep_get_default_config(sleep_flags, &config);
    rtc_sleep_init(config);

    // Set state machine time for light sleep
    if (!deep_sleep) {
        rtc_sleep_low_init(s_config.rtc_clk_cal_period);
    }

    // Configure timer wakeup
    if (s_config.wakeup_triggers & RTC_TIMER_TRIG_EN) {
        timer_wakeup_prepare();
    }

    uint32_t result;
    if (deep_sleep) {
#if !CONFIG_IDF_TARGET_ESP32H2 // IDF does not officially support esp32h2 in
                               // v4.4
        esp_sleep_isolate_digital_gpio();
#endif

#if SOC_PM_SUPPORT_DEEPSLEEP_VERIFY_STUB_ONLY
        extern char _rtc_text_start[];
#if CONFIG_ESP32S3_RTCDATA_IN_FAST_MEM
        extern char _rtc_noinit_end[];
        size_t rtc_fast_length =
            (size_t)_rtc_noinit_end - (size_t)_rtc_text_start;
#else
        extern char _rtc_force_fast_end[];
        size_t rtc_fast_length =
            (size_t)_rtc_force_fast_end - (size_t)_rtc_text_start;
#endif
        esp_rom_set_rtc_wake_addr((esp_rom_wake_func_t)esp_wake_stub_entry,
                                  rtc_fast_length);
        result = call_rtc_sleep_start(reject_triggers, config.lslp_mem_inf_fpu);
#else
#if !CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP
        /* If not possible stack is in RTC FAST memory, use the ROM function to
         * calculate the CRC and save ~140 bytes IRAM */
        set_rtc_memory_crc();
        result = call_rtc_sleep_start(reject_triggers, config.lslp_mem_inf_fpu);
#else
        /* Otherwise, need to call the dedicated soc function for this */
        result =
            rtc_deep_sleep_start(s_config.wakeup_triggers, reject_triggers);
#endif
#endif // SOC_PM_SUPPORT_DEEPSLEEP_VERIFY_STUB_ONLY
    } else {
        result = call_rtc_sleep_start(reject_triggers, config.lslp_mem_inf_fpu);
    }

    // Restore CPU frequency
    rtc_clk_cpu_freq_set_config(&cpu_freq_config);

    if (!deep_sleep) {
        s_config.ccount_ticks_record = cpu_ll_get_cycle_count();
        misc_modules_wake_prepare();
    }

    // re-enable UART output
    resume_uarts();

    return result;
}

inline static uint32_t IRAM_ATTR
call_rtc_sleep_start(uint32_t reject_triggers, uint32_t lslp_mem_inf_fpu) {
#ifdef CONFIG_IDF_TARGET_ESP32
    return rtc_sleep_start(s_config.wakeup_triggers, reject_triggers);
#else
    return rtc_sleep_start(s_config.wakeup_triggers, reject_triggers,
                           lslp_mem_inf_fpu);
#endif
}

void IRAM_ATTR esp_deep_sleep_start(void) {
#if CONFIG_IDF_TARGET_ESP32S2
    /* Due to hardware limitations, on S2 the brownout detector sometimes
       trigger during deep sleep to circumvent this we disable the brownout
       detector before sleeping  */
    esp_brownout_disable();
#endif // CONFIG_IDF_TARGET_ESP32S2

    esp_sync_counters_rtc_and_frc();

    /* Disable interrupts and stall another core in case another task writes
     * to RTC memory while we calculate RTC memory CRC.
     */
    portENTER_CRITICAL(&spinlock_rtc_deep_sleep);
    esp_ipc_isr_stall_other_cpu();

    // record current RTC time
    s_config.rtc_ticks_at_sleep_start = rtc_time_get();

    // Configure wake stub
    if (esp_get_deep_sleep_wake_stub() == NULL) {
        esp_set_deep_sleep_wake_stub(esp_wake_deep_sleep);
    }

    // Decide which power domains can be powered down
    uint32_t pd_flags = get_power_down_flags();

    s_config.rtc_clk_cal_period = esp_clk_slowclk_cal_get();

    // Correct the sleep time
    s_config.sleep_time_adjustment = DEEP_SLEEP_TIME_OVERHEAD_US;

    uint32_t force_pd_flags = RTC_SLEEP_PD_DIG | RTC_SLEEP_PD_VDDSDIO |
                              RTC_SLEEP_PD_INT_8M | RTC_SLEEP_PD_XTAL;

#if SOC_PM_SUPPORT_WIFI_PD
    force_pd_flags |= RTC_SLEEP_PD_WIFI;
#endif

#if SOC_PM_SUPPORT_BT_PD
    force_pd_flags |= RTC_SLEEP_PD_BT;
#endif

    // Enter sleep
    esp_sleep_start(force_pd_flags | pd_flags);

    // Because RTC is in a slower clock domain than the CPU, it
    // can take several CPU cycles for the sleep mode to start.
    while (1) {
        ;
    }
    // Never returns here
    esp_ipc_isr_release_other_cpu();
    portEXIT_CRITICAL(&spinlock_rtc_deep_sleep);
}

/**
 * Helper function which handles entry to and exit from light sleep
 * Placed into IRAM as flash may need some time to be powered on.
 */
static esp_err_t
esp_light_sleep_inner(uint32_t pd_flags, uint32_t flash_enable_time_us,
                      rtc_vddsdio_config_t vddsdio_config) IRAM_ATTR
    __attribute__((noinline));

static esp_err_t esp_light_sleep_inner(uint32_t pd_flags,
                                       uint32_t flash_enable_time_us,
                                       rtc_vddsdio_config_t vddsdio_config) {
    // Enter sleep
    uint32_t reject = esp_sleep_start(pd_flags);

    // If VDDSDIO regulator was controlled by RTC registers before sleep,
    // restore the configuration.
    if (vddsdio_config.force) {
        rtc_vddsdio_set_config(vddsdio_config);
    }

    // If SPI flash was powered down, wait for it to become ready
    if (pd_flags & RTC_SLEEP_PD_VDDSDIO) {
        // Wait for the flash chip to start up
        esp_rom_delay_us(flash_enable_time_us);
    }

    return reject ? ESP_ERR_SLEEP_REJECT : ESP_OK;
}

/**
 * vddsdio is used for power supply of spi flash
 *
 * pd flash via menuconfig  |  pd flash via `esp_sleep_pd_config`  |  result
 * ---------------------------------------------------------------------------------------------------
 * 0                        |  0                                   |  no pd
 * flash x                        |  1                                   |  pd
 * flash with relaxed conditions(force_pd) 1                        |  0 |  pd
 * flash with strict  conditions(safe_pd)
 */
static inline bool
can_power_down_vddsdio(const uint32_t vddsdio_pd_sleep_duration) {
    bool force_pd = !(s_config.wakeup_triggers & RTC_TIMER_TRIG_EN) ||
                    (s_config.sleep_duration > vddsdio_pd_sleep_duration);
    bool safe_pd = (s_config.wakeup_triggers == RTC_TIMER_TRIG_EN) &&
                   (s_config.sleep_duration > vddsdio_pd_sleep_duration);
    return (s_config.pd_options[ESP_PD_DOMAIN_VDDSDIO] == ESP_PD_OPTION_OFF)
               ? force_pd
               : safe_pd;
}

esp_err_t esp_light_sleep_start(void) {
    esp_err_t err = ESP_OK;
#ifdef ENABLE_LIGHT_SLEEP
    s_config.ccount_ticks_record = cpu_ll_get_cycle_count();
    static portMUX_TYPE light_sleep_lock = portMUX_INITIALIZER_UNLOCKED;
    portENTER_CRITICAL(&light_sleep_lock);
    /*
    Note: We are about to stall the other CPU via the
    esp_ipc_isr_stall_other_cpu(). However, there is a chance of deadlock if
    after stalling the other CPU, we attempt to take spinlocks already held by
    the other CPU that is.

    Thus any functions that we call after stalling the other CPU will need to
    have the locks taken first to avoid deadlock.

    Todo: IDF-5257
    */

    /* We will be calling esp_timer_private_advance inside DPORT access critical
     * section. Make sure the code on the other CPU is not holding esp_timer
     * lock, otherwise there will be deadlock.
     */
    esp_timer_private_lock();

    /* We will be calling esp_rtc_get_time_us() below. Make sure the code on the
     * other CPU is not holding the esp_rtc_get_time_us() lock, otherwise there
     * will be deadlock. esp_rtc_get_time_us() is called via:
     *
     * - esp_clk_slowclk_cal_set() -> esp_rtc_get_time_us()
     */
    esp_clk_private_lock();

    s_config.rtc_ticks_at_sleep_start = rtc_time_get();
    uint32_t ccount_at_sleep_start = cpu_ll_get_cycle_count();
    uint64_t frc_time_at_start = esp_timer_get_time();
    uint32_t sleep_time_overhead_in =
        (ccount_at_sleep_start - s_config.ccount_ticks_record) /
        (esp_clk_cpu_freq() / 1000000ULL);

    esp_ipc_isr_stall_other_cpu();

    // Decide which power domains can be powered down
    uint32_t pd_flags = get_power_down_flags();

#ifdef CONFIG_ESP_SLEEP_RTC_BUS_ISO_WORKAROUND
    pd_flags &= ~RTC_SLEEP_PD_RTC_PERIPH;
#endif

    // Re-calibrate the RTC Timer clock
#ifdef CONFIG_ESP_SYSTEM_RTC_EXT_XTAL
    if (rtc_clk_slow_freq_get() == RTC_SLOW_FREQ_32K_XTAL) {
        uint64_t time_per_us = 1000000ULL;
        s_config.rtc_clk_cal_period =
            (time_per_us << RTC_CLK_CAL_FRACT) / rtc_clk_slow_freq_get_hz();
    } else {
        // If the external 32 kHz XTAL does not exist, use the internal 150 kHz
        // RC oscillator as the RTC slow clock source.
        s_config.rtc_clk_cal_period =
            rtc_clk_cal(RTC_CAL_RTC_MUX, RTC_CLK_SRC_CAL_CYCLES);
        esp_clk_slowclk_cal_set(s_config.rtc_clk_cal_period);
    }
#elif defined(CONFIG_ESP32S2_RTC_CLK_SRC_INT_RC)
    s_config.rtc_clk_cal_period =
        rtc_clk_cal_cycling(RTC_CAL_RTC_MUX, RTC_CLK_SRC_CAL_CYCLES);
    esp_clk_slowclk_cal_set(s_config.rtc_clk_cal_period);
#else
    s_config.rtc_clk_cal_period =
        rtc_clk_cal(RTC_CAL_RTC_MUX, RTC_CLK_SRC_CAL_CYCLES);
    esp_clk_slowclk_cal_set(s_config.rtc_clk_cal_period);
#endif

