domhathair/esp32-c3/lib/Sleep/include/sleep_modes.h
    /*
     * Adjustment time consists of parts below:
     * 1. Hardware time waiting for internal 8M oscilate clock and XTAL;
     * 2. Hardware state swithing time of the rtc main state machine;
     * 3. Code execution time when clock is not stable;
     * 4. Code execution time which can be measured;
     */

    uint32_t rtc_cntl_xtl_buf_wait_slp_cycles = rtc_time_us_to_slowclk(
        RTC_CNTL_XTL_BUF_WAIT_SLP_US, s_config.rtc_clk_cal_period);
    s_config.sleep_time_adjustment =
        LIGHT_SLEEP_TIME_OVERHEAD_US + sleep_time_overhead_in +
        s_config.sleep_time_overhead_out +
        rtc_time_slowclk_to_us(rtc_cntl_xtl_buf_wait_slp_cycles +
                                   RTC_CNTL_CK8M_WAIT_SLP_CYCLES +
                                   RTC_CNTL_WAKEUP_DELAY_CYCLES,
                               s_config.rtc_clk_cal_period);

    // Decide if VDD_SDIO needs to be powered down;
    // If it needs to be powered down, adjust sleep time.
    const uint32_t flash_enable_time_us =
        VDD_SDIO_POWERUP_TO_FLASH_READ_US + DEEP_SLEEP_WAKEUP_DELAY;

    /**
     * If VDD_SDIO power domain is requested to be turned off, bit
     * `RTC_SLEEP_PD_VDDSDIO` will be set in `pd_flags`.
     */
    if (pd_flags & RTC_SLEEP_PD_VDDSDIO) {
        /*
         * When VDD_SDIO power domain has to be turned off, the minimum sleep
         * time of the system needs to meet the sum below:
         * 1. Wait time for the flash power-on after waking up;
         * 2. The execution time of codes between RTC Timer get start time
         *    with hardware starts to switch state to sleep;
         * 3. The hardware state switching time of the rtc state machine during
         *    sleep and wake-up. This process requires 6 cycles to complete.
         *    The specific hardware state switching process and the cycles
         *    consumed are rtc_cpu_run_stall(1), cut_pll_rtl(2), cut_8m(1),
         *    min_protect(2);
         * 4. All the adjustment time which is s_config.sleep_time_adjustment
         * below.
         */
        const uint32_t vddsdio_pd_sleep_duration =
            MAX(FLASH_PD_MIN_SLEEP_TIME_US,
                flash_enable_time_us + LIGHT_SLEEP_MIN_TIME_US +
                    s_config.sleep_time_adjustment +
                    rtc_time_slowclk_to_us(RTC_MODULE_SLEEP_PREPARE_CYCLES,
                                           s_config.rtc_clk_cal_period));

        if (can_power_down_vddsdio(vddsdio_pd_sleep_duration)) {
            if (s_config.sleep_time_overhead_out < flash_enable_time_us) {
                s_config.sleep_time_adjustment += flash_enable_time_us;
            }
        } else {
            /**
             * Minimum sleep time is not enough, then keep the VDD_SDIO power
             * domain on.
             */
            pd_flags &= ~RTC_SLEEP_PD_VDDSDIO;
            if (s_config.sleep_time_overhead_out > flash_enable_time_us) {
                s_config.sleep_time_adjustment -= flash_enable_time_us;
            }
        }
    }

    periph_inform_out_light_sleep_overhead(s_config.sleep_time_adjustment -
                                           sleep_time_overhead_in);

    rtc_vddsdio_config_t vddsdio_config = rtc_vddsdio_get_config();

    // Safety net: enable WDT in case exit from light sleep fails
    wdt_hal_context_t rtc_wdt_ctx = {.inst = WDT_RWDT, .rwdt_dev = &RTCCNTL};
    bool wdt_was_enabled =
        wdt_hal_is_enabled(&rtc_wdt_ctx); // If WDT was enabled in the user
                                          // code, then do not change it here.
    if (!wdt_was_enabled) {
        wdt_hal_init(&rtc_wdt_ctx, WDT_RWDT, 0, false);
        uint32_t stage_timeout_ticks =
            (uint32_t)(1000ULL * rtc_clk_slow_freq_get_hz() / 1000ULL);
        wdt_hal_write_protect_disable(&rtc_wdt_ctx);
        wdt_hal_config_stage(&rtc_wdt_ctx, WDT_STAGE0, stage_timeout_ticks,
                             WDT_STAGE_ACTION_RESET_RTC);
        wdt_hal_enable(&rtc_wdt_ctx);
        wdt_hal_write_protect_enable(&rtc_wdt_ctx);
    }

    int64_t final_sleep_duration_us = (int64_t)s_config.sleep_duration -
                                      (int64_t)s_config.sleep_time_adjustment;
    int64_t min_sleep_duration_us = rtc_time_slowclk_to_us(
        RTC_CNTL_MIN_SLP_VAL_MIN, s_config.rtc_clk_cal_period);

    // reset light sleep wakeup flag before a new light sleep
    s_light_sleep_wakeup = false;

    // if rtc timer wakeup source is enabled, need to compare final sleep
    // duration and min sleep duration to avoid late wakeup
    if ((s_config.wakeup_triggers & RTC_TIMER_TRIG_EN) &&
        (final_sleep_duration_us <= min_sleep_duration_us)) {
        err = ESP_ERR_SLEEP_TOO_SHORT_SLEEP_DURATION;
    } else {
        // Enter sleep, then wait for flash to be ready on wakeup
        err = esp_light_sleep_inner(pd_flags, flash_enable_time_us,
                                    vddsdio_config);
    }

    // light sleep wakeup flag only makes sense after a successful light sleep
    s_light_sleep_wakeup = (err == ESP_OK);

    // FRC1 has been clock gated for the duration of the sleep, correct for
    // that.
#ifdef CONFIG_IDF_TARGET_ESP32C3
    /**
     * On esp32c3, rtc_time_get() is non-blocking, esp_timer_get_time() is
     * blocking, and the measurement data shows that this order is better.
     */
    uint64_t frc_time_at_end = esp_timer_get_time();
    uint64_t rtc_ticks_at_end = rtc_time_get();
#else
    uint64_t rtc_ticks_at_end = rtc_time_get();
    uint64_t frc_time_at_end = esp_timer_get_time();
#endif

    uint64_t rtc_time_diff = rtc_time_slowclk_to_us(
        rtc_ticks_at_end - s_config.rtc_ticks_at_sleep_start,
        s_config.rtc_clk_cal_period);
    uint64_t frc_time_diff = frc_time_at_end - frc_time_at_start;

    int64_t time_diff = rtc_time_diff - frc_time_diff;
    /* Small negative values (up to 1 RTC_SLOW clock period) are possible,
     * for very small values of sleep_duration. Ignore those to keep esp_timer
     * monotonic.
     */
    if (time_diff > 0) {
        esp_timer_private_advance(time_diff);
    }
    esp_set_time_from_rtc();

    esp_clk_private_unlock();
    esp_timer_private_unlock();
    esp_ipc_isr_release_other_cpu();
    if (!wdt_was_enabled) {
        wdt_hal_write_protect_disable(&rtc_wdt_ctx);
        wdt_hal_disable(&rtc_wdt_ctx);
        wdt_hal_write_protect_enable(&rtc_wdt_ctx);
    }
    portEXIT_CRITICAL(&light_sleep_lock);
    s_config.sleep_time_overhead_out =
        (cpu_ll_get_cycle_count() - s_config.ccount_ticks_record) /
        (esp_clk_cpu_freq() / 1000000ULL);
#endif // ENABLE_LIGHT_SLEEP
    return err;
}

